IRP/src/Enums/AgreementTypes/AgreementTypes.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
 <name>AgreementTypes</name>
 <enumValues>
  <name>Customer</name>
 </enumValues>
 <enumValues>
  <name>Vendor</name>
 </enumValues>
 <enumValues>
  <name>Consignor</name>
 </enumValues>
 <enumValues>
  <name>TradeAgent</name>
 </enumValues>
 <enumValues>
  <name>Other</name>
 </enumValues>
</mdclass:Enum>

IRP/src/Catalogs/Agreements/Agreements.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
 <name>Agreements</name>
 <attributes>
  <name>Number</name>
  <type>
   <types>String</types>
   <stringQualifiers>
    <length>30</length>
   </stringQualifiers>
  </type>
 </attributes>
 <attributes>
  <name>Date</name>
  <type>
   <types>Date</types>
   <dateQualifiers>
    <dateFractions>Date</dateFractions>
   </dateQualifiers>
  </type>
 </attributes>
 <attributes>
  <name>PartnerSegment</name>
  <type>
   <types>CatalogRef.PartnerSegments</types>
  </type>
 </attributes>
 <attributes>
  <name>Partner</name>
  <type>
   <types>CatalogRef.Partners</types>
  </type>
 </attributes>
 <attributes>
  <name>Company</name>
  <type>
   <types>CatalogRef.Companies</types>
  </type>
 </attributes>
 <attributes>
  <name>PriceType</name>
  <type>
   <types>CatalogRef.PriceTypes</types>
  </type>
 </attributes>
 <attributes>
  <name>ItemSegment</name>
  <type>
   <types>CatalogRef.ItemSegments</types>
  </type>
 </attributes>
 <attributes>
  <name>StartUsing</name>
  <type>
   <types>Date</types>
   <dateQualifiers>
    <dateFractions>Date</dateFractions>
   </dateQualifiers>
  </type>
 </attributes>
 <attributes>
  <name>EndOfUse</name>
  <type>
   <types>Date</types>
   <dateQualifiers>
    <dateFractions>Date</dateFractions>
   </dateQualifiers>
  </type>
 </attributes>
 <attributes>
  <name>ManagerSegment</name>
  <type>
   <types>CatalogRef.PartnerSegments</types>
  </type>
 </attributes>
 <attributes>
  <name>PriceIncludeTax</name>
  <type>
   <types>Boolean</types>
  </type>
 </attributes>
 <attributes>
  <name>DaysBeforeDelivery</name>
  <type>
   <types>Number</types>
   <numberQualifiers>
    <precision>2</precision>
   </numberQualifiers>
  </type>
 </attributes>
 <attributes>
  <name>Store</name>
  <type>
   <types>CatalogRef.Stores</types>
  </type>
 </attributes>
 <attributes>
  <name>Type</name>
  <type>
   <types>EnumRef.AgreementTypes</types>
  </type>
 </attributes>
 <attributes>
  <name>LegalName</name>
  <type>
   <types>CatalogRef.Companies</types>
  </type>
 </attributes>
 <attributes>
  <name>CurrencyMovementType</name>
  <type>
   <types>ChartOfCharacteristicTypesRef.CurrencyMovementType</types>
  </type>
 </attributes>
 <attributes>
  <name>ApArPostingDetail</name>
  <type>
   <types>EnumRef.ApArPostingDetail</types>
  </type>
 </attributes>
 <attributes>
  <name>StandardAgreement</name>
  <type>
   <types>CatalogRef.Agreements</types>
  </type>
 </attributes>
 <attributes>
  <name>Kind</name>
  <type>
   <types>EnumRef.AgreementKinds</types>
  </type>
 </attributes>
 <attributes>
  <name>UseCreditLimit</name>
  <type>
   <types>Boolean</types>
  </type>
 </attributes>
 <attributes>
  <name>CreditLimitAmount</name>
  <type>
   <types>DefinedType.typeAmount</types>
  </type>
 </attributes>
 <attributes>
  <name>PaymentTerm</name>
  <type>
   <types>CatalogRef.PaymentSchedules</types>
  </type>
 </attributes>
 <attributes>
  <name>TradeAgentFeeType</name>
  <type>
   <types>EnumRef.TradeAgentFeeTypes</types>
  </type>
 </attributes>
 <attributes>
  <name>TradeAgentFeePercent</name>
  <type>
   <types>DefinedType.typePercent</types>
  </type>
 </attributes>
 <attributes>
  <name>TradeAgentFeeItem</name>
  <type>
   <types>CatalogRef.Items</types>
  </type>
 </attributes>
 <attributes>
  <name>TradeAgentFeeItemKey</name>
  <type>
   <types>CatalogRef.ItemKeys</types>
  </type>
 </attributes>
 <attributes>
  <name>TradeAgentFeeProfitLossCenter</name>
  <type>
   <types>CatalogRef.BusinessUnits</types>
  </type>
 </attributes>
 <attributes>
  <name>TradeAgentFeeExpenseRevenueType</name>
  <type>
   <types>CatalogRef.ExpenseAndRevenueTypes</types>
  </type>
 </attributes>
 <attributes>
  <name>RecordPurchasePrices</name>
  <type>
   <types>Boolean</types>
  </type>
 </attributes>
 <attributes>
  <name>Account</name>
  <type>
   <types>CatalogRef.PartnersBankAccounts</types>
  </type>
 </attributes>
 <attributes>
  <name>UseOrdersForSettlements</name>
  <type>
   <types>Boolean</types>
  </type>
 </attributes>
 <tabularSections>
  <name>AddAttributes</name>
  <attributes>
   <name>Property</name>
   <type>
    <types>ChartOfCharacteristicTypesRef.AddAttributeAndProperty</types>
   </type>
  </attributes>
  <attributes>
   <name>Value</name>
   <type>
    <types>Characteristic.AddAttributeAndProperty</types>
   </type>
  </attributes>
 </tabularSections>
</mdclass:Catalog>

IRP/src/Catalogs/Companies/Companies.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
 <name>Companies</name>
 <predefined>
  <items>
   <name>Default</name>
  </items>
 </predefined>
 <attributes>
  <name>Country</name>
  <type>
   <types>CatalogRef.Countries</types>
  </type>
 </attributes>
 <attributes>
  <name>MainCompany</name>
  <type>
   <types>CatalogRef.Companies</types>
  </type>
 </attributes>
 <attributes>
  <name>Partner</name>
  <type>
   <types>CatalogRef.Partners</types>
  </type>
 </attributes>
 <attributes>
  <name>Type</name>
  <type>
   <types>EnumRef.CompanyLegalType</types>
  </type>
 </attributes>
 <attributes>
  <name>OurCompany</name>
  <type>
   <types>Boolean</types>
  </type>
 </attributes>
 <attributes>
  <name>LandedCostCurrencyMovementType</name>
  <type>
   <types>ChartOfCharacteristicTypesRef.CurrencyMovementType</types>
  </type>
 </attributes>
 <attributes>
  <name>LandedCostExpenseType</name>
  <type>
   <types>CatalogRef.ExpenseAndRevenueTypes</types>
  </type>
 </attributes>
 <attributes>
  <name>LandedCostFillEmptyAmount</name>
  <type>
   <types>Boolean</types>
  </type>
 </attributes>
 <attributes>
  <name>LandedCostPriceTypeForEmptyAmount</name>
  <type>
   <types>CatalogRef.PriceTypes</types>
  </type>
 </attributes>
 <attributes>
  <name>TradeAgentStore</name>
  <type>
   <types>CatalogRef.Stores</types>
  </type>
 </attributes>
 <attributes>
  <name>TaxID</name>
  <type>
   <types>String</types>
   <stringQualifiers>
    <length>20</length>
   </stringQualifiers>
  </type>
 </attributes>
 <attributes>
  <name>MainPhoneNumber</name>
  <type>
   <types>String</types>
   <stringQualifiers>
    <length>50</length>
   </stringQualifiers>
  </type>
 </attributes>
 <attributes>
  <name>SalaryAccrualVacation</name>
  <type>
   <types>CatalogRef.AccrualAndDeductionTypes</types>
  </type>
 </attributes>
 <attributes>
  <name>SalaryMaxDaysVacation</name>
  <type>
   <types>Number</types>
   <numberQualifiers>
    <precision>3</precision>
   </numberQualifiers>
  </type>
 </attributes>
 <attributes>
  <name>SalaryAccrualSickLeave</name>
  <type>
   <types>CatalogRef.AccrualAndDeductionTypes</types>
  </type>
 </attributes>
 <attributes>
  <name>SalaryMaxDaysSickLeave</name>
  <type>
   <types>Number</types>
   <numberQualifiers>
    <precision>3</precision>
   </numberQualifiers>
  </type>
 </attributes>
 <attributes>
  <name>SalaryBasicPayroll</name>
  <type>
   <types>CatalogRef.AccrualAndDeductionTypes</types>
  </type>
 </attributes>
 <attributes>
  <name>PrintInfo</name>
  <type>
   <types>CatalogRef.PrintInfo</types>
  </type>
 </attributes>
 <attributes>
  <name>MainLegalAddress</name>
  <type>
   <types>String</types>
   <stringQualifiers>
    <length>1024</length>
   </stringQualifiers>
  </type>
 </attributes>
 <attributes>
  <name>LegalCurrencyMovementType</name>
  <type>
   <types>ChartOfCharacteristicTypesRef.CurrencyMovementType</types>
  </type>
 </attributes>
 <attributes>
  <name>BillingEmail</name>
  <type>
   <types>String</types>
   <stringQualifiers>
    <length>50</length>
   </stringQualifiers>
  </type>
 </attributes>
 <attributes>
  <name>CurrencyRevaluationItem</name>
  <type>
   <types>CatalogRef.Items</types>
  </type>
 </attributes>
 <attributes>
  <name>CurrencyRevaluationItemKey</name>
  <type>
   <types>CatalogRef.ItemKeys</types>
  </type>
 </attributes>
 <attributes>
  <name>BatchID</name>
  <type>
   <types>String</types>
   <stringQualifiers>
    <length>20</length>
   </stringQualifiers>
  </type>
 </attributes>
 <attributes>
  <name>EntityID</name>
  <type>
   <types>String</types>
   <stringQualifiers>
    <length>20</length>
   </stringQualifiers>
  </type>
 </attributes>
 <tabularSections>
  <name>Currencies</name>
  <attributes>
   <name>MovementType</name>
   <type>
    <types>ChartOfCharacteristicTypesRef.CurrencyMovementType</types>
   </type>
  </attributes>
 </tabularSections>
 <tabularSections>
  <name>AddAttributes</name>
  <attributes>
   <name>Property</name>
   <type>
    <types>ChartOfCharacteristicTypesRef.AddAttributeAndProperty</types>
   </type>
  </attributes>
  <attributes>
   <name>Value</name>
   <type>
    <types>Characteristic.AddAttributeAndProperty</types>
   </type>
  </attributes>
 </tabularSections>
</mdclass:Catalog>

IRP/src/CommonModules/DocSalesReturnServer/Module.bsl
#Region FormEvents

Procedure OnCreateAtServer(Object, Form, Cancel, StandardProcessing) Export
	DocumentsServer.OnCreateAtServer(Object, Form, Cancel, StandardProcessing);
	DocumentsClientServer.ChangeTitleCollapse(Object, Form, Not ValueIsFilled(Object.Ref));
	If Form.Parameters.Key.IsEmpty() Then
		Form.CurrentPartner = Object.Partner;
		Form.CurrentAgreement = Object.Agreement;
		Form.CurrentDate = Object.Date;
		Form.StoreBeforeChange 		= Form.Store;
		
		DocumentsClientServer.FillDefinedData(Object, Form);
		
		SetGroupItemsList(Object, Form);
		DocumentsServer.FillItemList(Object);
		
		ObjectData = DocumentsClientServer.GetStructureFillStores();
		FillPropertyValues(ObjectData, Object);
		DocumentsClientServer.FillStores(ObjectData, Form);
		
		DocumentsClientServer.ChangeTitleGroupTitle(Object, Form);
	EndIf;
	DocumentsServer.ShowUserMessageOnCreateAtServer(Form);
EndProcedure

Procedure AfterWriteAtServer(Object, Form, CurrentObject, WriteParameters) Export
	Form.CurrentPartner = CurrentObject.Partner;
	Form.CurrentAgreement = CurrentObject.Agreement;
	Form.CurrentDate = CurrentObject.Date;
	DocumentsServer.FillItemList(Object);
	
	ObjectData = DocumentsClientServer.GetStructureFillStores();
	FillPropertyValues(ObjectData, CurrentObject);
	DocumentsClientServer.FillStores(ObjectData, Form);
	
	DocumentsClientServer.ChangeTitleGroupTitle(CurrentObject, Form);
EndProcedure

Procedure OnReadAtServer(Object, Form, CurrentObject) Export
	Form.CurrentPartner = CurrentObject.Partner;
	Form.CurrentAgreement = CurrentObject.Agreement;
	Form.CurrentDate = CurrentObject.Date;
		
	DocumentsServer.FillItemList(Object);
	
	ObjectData = DocumentsClientServer.GetStructureFillStores();
	FillPropertyValues(ObjectData, CurrentObject);
	DocumentsClientServer.FillStores(ObjectData, Form);
	
	If Not Form.GroupItems.Count() Then
		SetGroupItemsList(Object, Form);
	EndIf;
	DocumentsClientServer.ChangeTitleGroupTitle(CurrentObject, Form);
EndProcedure

#EndRegion

#Region GroupTitle

Procedure SetGroupItemsList(Object, Form)
	AttributesArray = New Array;
	AttributesArray.Add("Company");
	AttributesArray.Add("Partner");
	AttributesArray.Add("LegalName");
	AttributesArray.Add("Agreement");
	DocumentsServer.DeleteUnavailableTitleItemNames(AttributesArray);
	For Each Atr In AttributesArray Do
		Form.GroupItems.Add(Atr, ?(ValueIsFilled(Form.Items[Atr].Title),
				Form.Items[Atr].Title,
				Object.Ref.Metadata().Attributes[Atr].Synonym + ":" + Chars.NBSp));
	EndDo;
EndProcedure

#EndRegion

Function GetAgreementByPartner(Partner, Agreement) Export
	If Not Partner.IsEmpty() Then
		ArrayOfFilters = New Array();
		ArrayOfFilters.Add(DocumentsClientServer.CreateFilterItem("DeletionMark", True, ComparisonType.NotEqual));
		ArrayOfFilters.Add(DocumentsClientServer.CreateFilterItem("Type", Enums.AgreementTypes.Customer, ComparisonType.Equal));
		If ValueIsFilled(Agreement) Then
			ArrayOfFilters.Add(DocumentsClientServer.CreateFilterItem("Ref", Agreement, ComparisonType.Equal));
		EndIf;
		AdditionalParameters = New Structure();
		AdditionalParameters.Insert("IncludeFilterByEndOfUseDate", True);
		AdditionalParameters.Insert("IncludeFilterByPartner", True);
		AdditionalParameters.Insert("IncludePartnerSegments", True);
		AdditionalParameters.Insert("EndOfUseDate", CurrentDate());
		AdditionalParameters.Insert("Partner", Partner);
		Parameters = New Structure("CustomSearchFilter, AdditionalParameters",
				DocumentsServer.SerializeArrayOfFilters(ArrayOfFilters),
				DocumentsServer.SerializeArrayOfFilters(AdditionalParameters));
		Return Catalogs.Agreements.GetDefaultChoiseRef(Parameters);
	EndIf;
	Return Undefined;
EndFunction

Function GetLegalNameByPartner(Partner, LegalName) Export
	If Not Partner.IsEmpty() Then
		ArrayOfFilters = New Array();
		ArrayOfFilters.Add(DocumentsClientServer.CreateFilterItem("DeletionMark", True, ComparisonType.NotEqual));
		If ValueIsFilled(LegalName) Then
			ArrayOfFilters.Add(DocumentsClientServer.CreateFilterItem("Ref", LegalName, ComparisonType.Equal));
		EndIf;
		AdditionalParameters = New Structure();
		If ValueIsFilled(Partner) Then
			AdditionalParameters.Insert("Partner", Partner);
			AdditionalParameters.Insert("FilterByPartnerHierarchy", True);
		EndIf;
		Parameters = New Structure("CustomSearchFilter, AdditionalParameters",
				DocumentsServer.SerializeArrayOfFilters(ArrayOfFilters),
				DocumentsServer.SerializeArrayOfFilters(AdditionalParameters));
		Return Catalogs.Companies.GetDefaultChoiseRef(Parameters);
	EndIf;
	Return Undefined;
EndFunction

#Region ListFormEvents

Procedure OnCreateAtServerListForm(Form, Cancel, StandardProcessing) Export
	DocumentsServer.OnCreateAtServerListForm(Form, Cancel, StandardProcessing);
EndProcedure

#EndRegion
